EDT/УТ/src/Catalogs/ГруппыПолигоновМаршрутизации/ГруппыПолигоновМаршрутизации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ГруппыПолигоновМаршрутизации</name>
  <attributes>
    <name>Терминал</name>
    <type>
      <types>CatalogRef.РегиональныеТерминалы</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПолигоныМаршрутизации</name>
    <attributes>
      <name>НомерПолигона</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

EDT/УТ/src/InformationRegisters/АктивнаяСхемаПолигональнойМаршрутизации/АктивнаяСхемаПолигональнойМаршрутизации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>АктивнаяСхемаПолигональнойМаршрутизации</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>СхемаПолигональнойМаршрутизации</name>
    <type>
      <types>CatalogRef.СхемыПолигональнойМаршрутизации</types>
    </type>
  </resources>
  <dimensions>
    <name>РегиональныйТерминал</name>
    <type>
      <types>CatalogRef.РегиональныеТерминалы</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

EDT/УТ/src/Catalogs/ГруппыПолигоновМаршрутизации/Forms/ФормаЭлемента/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Объект.Ссылка.Пустая() Тогда
		
		Элементы.Терминал.ТолькоПросмотр = Ложь;
		
	Иначе
		
		ГруппаОбъект = РеквизитФормыВЗначение("Объект");	
		Если ГруппаОбъект.ПроверкаНаличияДанныхВРСПолигоныОпределенияСменыМаршрутизации() Тогда
			
			Элементы.НадписьБлокировки.Видимость = Истина;
			ЭтотОбъект.ТолькоПросмотр = Истина;
			
		КонецеСли;	
		
	КонецеСли;	
	
	УстановитьТекущуюАктивнуюСхемуПолигональнойМаршрутизации()
	
КонецПроцедуры

&НаСервере
Процедура УстановитьТекущуюАктивнуюСхемуПолигональнойМаршрутизации()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	АктивнаяСхемаПолигональнойМаршрутизацииСрезПоследних.СхемаПолигональнойМаршрутизации КАК Схема
	               |ИЗ
	               |	РегистрСведений.АктивнаяСхемаПолигональнойМаршрутизации.СрезПоследних(, РегиональныйТерминал.Ссылка = &Терминал) КАК АктивнаяСхемаПолигональнойМаршрутизацииСрезПоследних";
	Запрос.УстановитьПараметр("Терминал", Объект.Терминал);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Если Выборка.Следующий() Тогда
		ТекущаяАктивнаяСхемаПолигональнойМаршрутизации = Выборка.Схема;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПолигоныНомерПолигонаПриИзменении(Элемент)
	ТекДанные = Элементы.Полигоны.ТекущиеДанные;
	Отбор = Новый Структура("НомерПолигона",ТекДанные.НомерПолигона);
	СтрокиНомеров = Объект.ПолигоныМаршрутизации.НайтиСтроки(Отбор);
	Если СтрокиНомеров.Количество() > 1 Тогда
		Сообщить("Такая строка уже есть!!!");
		ТекДанные.НаименованиеПолигона = "";
		ТекДанные.НомерПолигона = 0;
	Иначе	
		ТекДанные.НаименованиеПолигона = ПолучитьНаименованиеПолигонаПоНомеру(ТекДанные.НомерПолигона);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПолучитьНаименованиеПолигонаПоНомеру(НомерПолигона);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ПолигоныМаршрутизации.Наименование КАК НаименованиеПолигона
	|ИЗ
	|	Справочник.ПолигоныМаршрутизации КАК ПолигоныМаршрутизации
	|ГДЕ
	|	ПолигоныМаршрутизации.Порядок = &НомерПолигона
	|	И ПолигоныМаршрутизации.Владелец = &Владелец";
	
	Запрос.УстановитьПараметр("Владелец",ТекущаяАктивнаяСхемаПолигональнойМаршрутизации);
	Запрос.УстановитьПараметр("НомерПолигона",НомерПолигона);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.НаименованиеПолигона;
	Иначе
		Возврат "Полигон с таким номером не найден";
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура ПолигоныПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Если Копирование Тогда
		Отказ = Истина;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСоответствияКодовИНаименованийПолигонов()
	Для Каждого Элем из Объект.ПолигоныМаршрутизации Цикл
		Элем.НаименованиеПолигона = ПолучитьНаименованиеПолигонаПоНомеру(Элем.НомерПолигона);
	КонецЦикла;	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ЗаполнитьСоответствияКодовИНаименованийПолигонов();
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	УдалениеНеАктуальныхСтрок();
КонецПроцедуры

&НаСервере
Процедура УдалениеНеАктуальныхСтрок()
	Отбор = Новый Структура("НаименованиеПолигона","Полигон с таким номером не найден");
	НайденныеСтроки = Объект.ПолигоныМаршрутизации.НайтиСтроки(Отбор);
	Для Каждого Элем из НайденныеСтроки Цикл
		  Объект.ПолигоныМаршрутизации.Удалить(Элем);
	КонецЦикла;
	Отбор = Новый Структура("НаименованиеПолигона","");
	НайденныеСтроки = Объект.ПолигоныМаршрутизации.НайтиСтроки(Отбор);
	Для Каждого Элем из НайденныеСтроки Цикл
		  Объект.ПолигоныМаршрутизации.Удалить(Элем);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	ЗаполнитьСоответствияКодовИНаименованийПолигонов();
КонецПроцедуры


&НаКлиенте
Процедура ТерминалПриИзменении(Элемент)
	// Вставить содержимое обработчика.
	УстановитьТекущуюАктивнуюСхемуПолигональнойМаршрутизации();
КонецПроцедуры
